[
  {
    "shortname": "VisSnippets",
    "name": "VisSnippets: A Web-based System for Impromptu Collaborative Data Exploration on Large Displays",
    "abstract": "The VisSnippets system is designed to facilitate effective collaborative data exploration. VisSnippets leverages SAGE2 middleware that enables users to manage the display of digital media content on large displays, thereby providing collaborators with a high-resolution common workspace. Based in JavaScript, the system provides users with the flexibility to implement and/or select visualization packages and to quickly access data in the cloud. By simplifying the application runtime and document manipulation, VisSnippets removes the need to scaffold and integrate interactive visualization applications by hand. Users write reusable blocks of code for data retrieval, transformation, and visualization. By composing various data pipelines from the groups collective 'snippet' pool, users can quickly execute and explore complementary or contrasting visualizations. By giving users the ability to explore alternative scenarios, VisSnippets facilitates parallel work for collaborative data exploration leveraging large-scale displays. We describe the system, provide implementation examples and evaluate it through expert interviews.",
    "team": "A. Burks, L. Renambot, A. Johnson",
    "image": "VisSnippets_Teaser.jpg",
    "award": "",
    "link": "https://www.evl.uic.edu/entry.php?id=2428",
    "github": "",
    "paper": ""
  },
  {
    "shortname": "SAGE2 + JupyterLab",
    "name": "SAGE2 + JupyterLab Integration",
    "abstract": "To better integrate existing data science workflows into the SAGE2 collaborative experience, we provide a SAGE2 plugin for JupyterLab. The plugin supports sharing both static notebooks, as well as dynamically updating cell content to SAGE2. A user simply connects to one or more SAGE2 server by URL, and can start sharing their Jupyter Notebook content. Shared notebooks are rendered by Jupyter nbviewer as static web-pages on the SAGE2 wall. Shared notebook cell image output is sent as an image to SAGE2 and dynamically updates every time that a cell is run.",
    "team": "A. Burks, L. Renambot",
    "image": "JupyterLab_SAGE2.jpg",
    "award": "",
    "link": "https://www.youtube.com/watch?v=l2pRLhw6GSE",
    "github": "https://github.com/AndrewTBurks/jupyterlab_sage2",
    "paper": ""
  },
  {
    "shortname": "FingerFinder",
    "name": "Details-First, Show Context, Overview Last: Supporting Exploration of Viscous Fingers in Large-Scale Ensemble Simulations",
    "abstract": "Visualization research often seeks designs that first establish an overview of the data, in accordance to the information seeking mantra: “Overview first, zoom and filter, then details on demand”. However, in computational fluid dynamics (CFD), as well as in other domains, there are many situations where such a spatial overview is not relevant or practical for users, for example when the experts already have a good mental overview of the data, or when an analysis of a large overall structure may not be related to the specific, information-driven tasks of users. Using scientific workflow theory and, as a vehicle, the problem of viscous finger evolution, we advocate an alternative model that allows domain experts to explore features of interest first, then explore the context around those features, and finally move to a potentially unfamiliar summarization overview. In a model instantiation, we show how a computational back-end can identify and track over time low-level, small features, then be used to filter the context of those features while controlling the complexity of the visualization, and finally to summarize and compare simulations. We demonstrate the effectiveness of this approach with an online web-based exploration of a total volume of data approaching half a billion seven-dimensional data points, and report supportive feedback provided by domain experts with respect to both the instantiation and the theoretical model.",
    "team": "T. Luciani, A. Burks, C. Sugiyama, J. Komperda, G. E. Marai",
    "image": "InteractiveExploration.jpg",
    "award": "Certificate of Merit - IEEE SciVis Contest 2016",
    "link": "https://andrewtburks.dev/FingerFinder/",
    "github": "https://github.com/AndrewTBurks/FingerFinder",
    "paper": "detailsfirst_ieee2018.pdf"
  },
  {
    "shortname": "Englewood Data Hub",
    "name": "Context-Aware Visualization of Englewood Social Services",
    "abstract": "The Englewood Data Hub (EDH) is a project that brings together both crowdsourced and public data surrounding the Englewood area into a single place.<br>The EDH Resource Directory makes use of the crowdsourced service and school data to display an interactive map with their locations. Its user interface (UI) allows for an exploratory experience that offers filtering of services by names and type and displays detailed information about the services available in Englewood.<br>The EDH Analytics Tool combines the crowdsourced service and school data with public data sets to display visualizations; specifically, the public datasets used are 2010 Census data along with Vacant Lot and Crime data from the Chicago Data Portal.<br>The Englewood Data Hub has been developed by a group of researchers at the Electronic Visualization Laboratory, University of Illinois at Chicago under the direction of Prof. G. Elisabeta Marai.<br>Team members include EVL research experience undergraduate students (REUs): Andrew Burks, Joshua Castor, and Isabel Lindmae.<br>This project is funded by the The Joseph and Bessie Feinberg Foundation and the University of Illinois at Chicago.",
    "team": "A. Burks, J. Castor, I. Lindmae, J. Feinberg, G. E. Marai",
    "image": "EnglewoodFinder.png",
    "award": "",
    "link": "https://englewooddatahub.org",
    "github": "https://github.com/uic-evl/EnglewoodSocialServices/",
    "paper": ""
  },
  {
    "shortname": "Dynamic Influence Networks",
    "name": "Dynamic Influence Networks for Rule-Based Models",
    "abstract": "We introduce the Dynamic Influence Network (DIN), a novel visual analytics technique for representing and analyzing rule-based models of protein-protein interaction networks. Rule-based modeling has proved instrumental in developing biological models that are concise, comprehensible, easily extensible, and that mitigate the combinatorial complexity of multi-state and multi-component biological molecules. Our technique visualizes the dynamics of these rules as they evolve over time. Using the data produced by KaSim, an open source stochastic simulator of rule-based models written in the Kappa language, DINs provide a node-link diagram that represents the influence that each rule has on the other rules. That is, rather than representing individual biological components or types, we instead represent the rules about them (as nodes) and the current influence of these rules (as links). Using our interactive DIN-Viz software tool, researchers are able to query this dynamic network to find meaningful patterns about biological processes, and to identify salient aspects of complex rule-based models. To evaluate the effectiveness of our approach, we investigate a simulation of a circadian clock model that illustrates the oscillatory behavior of the KaiC protein phosphorylation cycle.",
    "team": "A. G. Forbes, A. Burks, K. Lee, X. Li, P. Boutillier, J. Krivine, and W. Fontana",
    "image": "DIN.png",
    "award": "",
    "link": "https://creativecodinglab.github.io/DynamicInfluenceNetworks/",
    "github": "https://github.com/CreativeCodingLab/DynamicInfluenceNetworks",
    "paper": "BURKS-LEE-2017- IEEE_TVCG 08017593-small.pdf"
  },
  {
    "shortname": "SAGE2 Partitions",
    "name": "SAGE2 Partitions",
    "abstract": "While SAGE2 allows users the complete freedom to organize their content, SAGE2 Partitions aim to provide optional structure to the organization. SAGE2 partitions can act as divisions of the screen space, deforming their neighbors when resized. The Partitions can be 'un-snapped' to allow for free movement, becoming a simple grouping of applications. Partitions can be 'tiled' organizing the content within into a grid. As content is added or removed from a Partiton, the groupings are dynamically updated and content dynamically rearranged. Click-and-drag interaction can be used both to create new Partitions in an empty space and essentially select apps to grab, or to 'cut' existing Partitions to divide the size and content.",
    "team": "A. Burks, L. Renambot",
    "image": "PartitionsSmall.jpg",
    "award": "",
    "link": "",
    "github": "",
    "paper": ""
  },
  {
    "shortname": "SMART UI",
    "name": "SMART UI",
    "abstract": "We present the design and evaluation of an integrated problem solving environment for cancer therapy analysis. The environment intertwines a statistical martingale model and a K Nearest Neighbor approach with visual encodings, including novel interactive nomograms, in order to compute and explain a patient's probability of survival as a function of similar patient results. A coordinated views paradigm enables exploration of the multivariate, heterogeneous and few-valued data from a large head and neck cancer repository. A visual scaffolding approach further enables users to build from familiar representations to unfamiliar ones.",
    "team": "G. E. Marai, C. Ma, A. Burks, F. Pellolio, G. Canahuate, D. Vock, A. S. R. Mohamed, and C. D. Fuller",
    "image": "SMARTer.png",
    "award": "",
    "link": "http://chihuama.com/SMARTER/",
    "github": "",
    "paper": ""
  },
  {
    "shortname": "EnsembleProb",
    "name": "EnsembleProb",
    "abstract": "We present a web-based visual analysis tool for the exploration of peak distributions over state space and simulation time in such stochastic networks, and the comparison of peak distributions between multiple simulations. Our approach combines multiple linked views to capture ensemble time-evolving probability landscapes. A peak trajectory cube provides users an overview of peak spatiotemporal distributions between six simulations. A peak projection map shows the exact peak locations of multiple simulations at the user selected time. At a more detailed level, users can inspect a particular state in the peak projection map to view for each simulation both the probability values over time, and the local probability landscape shapes. This information is displayed in a small multiple using two glyphs: profile glyphs and arrow glyphs. The arrow glyph indicates that a state is a peak when all the glyph eight arrows point towards the glyph center.",
    "team": "C. Ma, A. Burks, T. Luciani, A. Terebus, J. Liang, and G. E. Marai",
    "image": "EnsembleProb.png",
    "award": "",
    "link": "http://chihuama.com/EnsembleProb/prototype",
    "github": "",
    "paper": ""
  },
  {
    "shortname": "Voronoi ACT",
    "name": "Multi-scale Voronoi-based ACT Assessment",
    "abstract": "Our contest submission aimed to develop a static visual representation that shows how geographic and seasonal changes in the availability of the ACT test affects nearby or adjacent testing sites, by moving students or assessments, changing dates, or some other strategy. The Voronoi visualization (Top Middle) encodes test center distribution at regional level (Illinois) by partitioning each region based on distances to test centers. The Voronoi cell intensity is mapped to Assigned/Capacity; the darker the cell, the higher demand in that region.",
    "team": "T. Luciani, J. Trelles, C. Ma, A. Burks, M. M. Thomas, K. Bharadwaj, S. Singh, P. Hanula, L. Di and G. E. Marai.",
    "image": "VGTC-data-contest.png",
    "award": "Honorable Mention - IEEE VGTC VPG Contest 2016",
    "link": "http://vacommunity.org/ieeevpg/viscontest/2016/entries/3.html",
    "github": "",
    "paper": ""
  }
]
